@alfespa17 I've whipped up https://github.com/AzBuilder/terraform-provider-terrakube/pull/112

Haven't touched go in years though so don't have high expectations.

```
➜  sss-test git:(handle-new-webhooks) ✗ terraform apply -auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - azbuilder/terrakube in /Users/xxx/go/bin
│
│ Provider development overrides are only configured locally and the remote operation won't be affected by them
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # terrakube_workspace_webhook_event.apply will be created
  + resource "terrakube_workspace_webhook_event" "apply" {
      + branch      = [
          + "main",
        ]
      + event       = "PUSH"
      + id          = (known after apply)
      + path        = [
          + "*.tf",
        ]
      + priority    = 2
      + template_id = "2841bc0c-b82a-49c7-a17b-e0e6f14f9c2b"
      + webhook_id  = (known after apply)
    }

  # terrakube_workspace_webhook_v2.webhook will be created
  + resource "terrakube_workspace_webhook_v2" "webhook" {
      + id              = (known after apply)
      + organization_id = "8502b9d8-6aa7-4464-ab84-63c21c8299a1"
      + remote_hook_id  = (known after apply)
      + workspace_id    = "9d1b1b48-7000-487f-b7c0-7e7b69d4cfe4"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
terrakube_workspace_webhook_v2.webhook: Creating...
terrakube_workspace_webhook_v2.webhook: Creation complete after 2s [id=d22794f6-69b1-4e2b-8bdb-d52e852e45e0]
terrakube_workspace_webhook_event.apply: Creating...
terrakube_workspace_webhook_event.apply: Creation complete after 1s [id=540c3e4e-5ee1-4c08-94b0-16bf51a9a548]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
➜  xxx-test git:(handle-new-webhooks) ✗ terraform apply -auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - azbuilder/terrakube in /Users/xxxpember/go/bin
│
│ Provider development overrides are only configured locally and the remote operation won't be affected by them
╵
terrakube_workspace_webhook_v2.webhook: Refreshing state... [id=d22794f6-69b1-4e2b-8bdb-d52e852e45e0]
terrakube_workspace_webhook_event.apply: Refreshing state... [id=540c3e4e-5ee1-4c08-94b0-16bf51a9a548]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # terrakube_workspace_webhook_event.apply will be updated in-place
  ~ resource "terrakube_workspace_webhook_event" "apply" {
        id          = "540c3e4e-5ee1-4c08-94b0-16bf51a9a548"
      ~ priority    = 2 -> 1
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
terrakube_workspace_webhook_event.apply: Modifying... [id=540c3e4e-5ee1-4c08-94b0-16bf51a9a548]
terrakube_workspace_webhook_event.apply: Modifications complete after 1s [id=540c3e4e-5ee1-4c08-94b0-16bf51a9a548]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
➜  xxx-test git:(handle-new-webhooks) terraform apply -auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - azbuilder/terrakube in /Users/xxxpember/go/bin
│
│ Provider development overrides are only configured locally and the remote operation won't be affected by them
╵
terrakube_workspace_webhook_event.apply: Refreshing state... [id=540c3e4e-5ee1-4c08-94b0-16bf51a9a548]
terrakube_workspace_webhook_v2.webhook: Refreshing state... [id=d22794f6-69b1-4e2b-8bdb-d52e852e45e0]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # terrakube_workspace_webhook_event.apply will be destroyed
  # (because terrakube_workspace_webhook_event.apply is not in configuration)
  - resource "terrakube_workspace_webhook_event" "apply" {
      - branch      = [
          - "main",
        ] -> null
      - event       = "PUSH" -> null
      - id          = "540c3e4e-5ee1-4c08-94b0-16bf51a9a548" -> null
      - path        = [
          - "*.tf",
        ] -> null
      - priority    = 1 -> null
      - template_id = "2841bc0c-b82a-49c7-a17b-e0e6f14f9c2b" -> null
      - webhook_id  = "d22794f6-69b1-4e2b-8bdb-d52e852e45e0" -> null
    }

  # terrakube_workspace_webhook_v2.webhook will be destroyed
  # (because terrakube_workspace_webhook_v2.webhook is not in configuration)
  - resource "terrakube_workspace_webhook_v2" "webhook" {
      - id              = "d22794f6-69b1-4e2b-8bdb-d52e852e45e0" -> null
      - organization_id = "8502b9d8-6aa7-4464-ab84-63c21c8299a1" -> null
      - remote_hook_id  = "550699651" -> null
      - workspace_id    = "9d1b1b48-7000-487f-b7c0-7e7b69d4cfe4" -> null
    }

Plan: 0 to add, 0 to change, 2 to destroy.
terrakube_workspace_webhook_event.apply: Destroying... [id=540c3e4e-5ee1-4c08-94b0-16bf51a9a548]
terrakube_workspace_webhook_event.apply: Destruction complete after 1s
terrakube_workspace_webhook_v2.webhook: Destroying... [id=d22794f6-69b1-4e2b-8bdb-d52e852e45e0]
terrakube_workspace_webhook_v2.webhook: Destruction complete after 1s

Apply complete! Resources: 0 added, 0 changed, 2 destroyed.
```